# Eat Safe, Love

## Notebook Set Up

In [2]:
# Import dependencies
from pymongo import MongoClient
from pprint import pprint
import pandas as pd

In [3]:
# Create an instance of MongoClient
mongo = MongoClient(port=27017)

In [4]:
# assign the uk_food database to a variable name
db = mongo['uk_food']

In [5]:
# review the collections in our database
print(db.list_collection_names())

['establishments']

In [6]:
# assign the collection to a variable
establishments = db['establishments']

## Part 3: Exploratory Analysis
Unless otherwise stated, for each question: 
* Use `count_documents` to display the number of documents contained in the result.
* Display the first document in the results using `pprint`.
* Convert the result to a Pandas DataFrame, print the number of rows in the DataFrame, and display the first 10 rows.

### 1. Which establishments have a hygiene score equal to 20?

In [7]:
# Find the establishments with a hygiene score of 20
query = {"scores.Hygiene": {'$eq': 20}}
fields = {'BusinessName': 1}
documents = establishments.find(query, fields)

# Use count_documents to display the number of documents in the result
count = establishments.count_documents(query)
pprint(count)

# Display the first document in the results using pprint
pprint(documents[0])

41
{'BusinessName': 'The Chase Rest Home',
 '_id': ObjectId('652955653aa8cbf72c74a09b')}

In [8]:
# Convert the result to a Pandas DataFrame
result_df = pd.DataFrame(documents)

# Display the number of rows in the DataFrame
print("Number of rows in Dataframe: ",len( result_df))

# Display the first 10 rows of the DataFrame
result_df.head(10)

Number of rows in Dataframe:  41

                        _id               BusinessName
0  652955653aa8cbf72c74a09b        The Chase Rest Home
1  652955653aa8cbf72c74a41b                 Brenalwood
2  652955653aa8cbf72c74a726              Melrose Hotel
3  652955653aa8cbf72c74a918              Seaford Pizza
4  652955653aa8cbf72c74a928              Golden Palace
5  652955653aa8cbf72c74b2c8           Ashby's Butchers
6  652955653aa8cbf72c74b4e3  South Sea Express Cuisine
7  652955663aa8cbf72c74ca0f              Golden Palace
8  652955663aa8cbf72c74ce53             The Tulip Tree
9  652955663aa8cbf72c74d664                      F & S

### ANSWER : Establishments with Hygiene score equal to 20 are listed below

In [9]:
result_df['BusinessName']

0                                   The Chase Rest Home
1                                            Brenalwood
2                                         Melrose Hotel
3                                         Seaford Pizza
4                                         Golden Palace
5                                      Ashby's Butchers
6                             South Sea Express Cuisine
7                                         Golden Palace
8                                        The Tulip Tree
9                                                 F & S
10                                            Longhouse
11    Westview Playgroup Based At Downsview Comm Pri...
12                          Whatever The Weather Coffee
13                          Kings Restaurant (Oriental)
14                                              Xich Lo
15        Asian Supermarket Ltd: T/A Best Food Wine Ltd
16                                               Londis
17                                           Costcutter
18                                         La Simon Ltd
19                                       Caribiscus Ltd
20                                Kennedy Fried Chicken
21                                            Gah Shing
22                                       A1 News & Wine
23                                        Cakes & Bakes
24                          Sahajanand Catering Limited
25                                           Sisko Cafe
26                               Magazin Romanesc Diana
27                                        Bali Maamalas
28                                        Angels Bakery
29                              Nikkis Place Restaurant
30                                           Chicago 30
31                                Samui Thai Restaurant
32                              Pakhtoonkhwa Restaurant
33                                     New Happy Garden
34                                            Mummy Yum
35                                            Gospodina
36                                    Leo's Bar & Grill
37                                           Royal Ribs
38                        Great Hallingbury Manor Hotel
39                                     The Dog And Duck
40                                     Oriental Cottage
Name: BusinessName, dtype: object

### 2. Which establishments in London have a `RatingValue` greater than or equal to 4?

In [10]:
# Find the establishments with London as the Local Authority and has a RatingValue greater than or equal to 4.
#query = {'LocalAuthorityName': 'London', "RatingValue": {'$gte': 4}}
query = {'LocalAuthorityName': {'$regex': "London"}}
fields = {'BusinessName': 1}
documents = establishments.find(query, fields)

# Use count_documents to display the number of documents in the result
count = establishments.count_documents(query)
pprint(count)

# Display the first document in the results using pprint
pprint(documents[0])

37
{'BusinessName': "Charlie's", '_id': ObjectId('652955653aa8cbf72c74bab8')}

In [11]:
# Convert the result to a Pandas DataFrame
result_df = pd.DataFrame(documents)

# Display the number of rows in the DataFrame
print("Number of rows in Dataframe: ",len( result_df))

# Display the first 10 rows of the DataFrame
result_df.head(10)

Number of rows in Dataframe:  37

                        _id                          BusinessName
0  652955653aa8cbf72c74bab8                             Charlie's
1  652955653aa8cbf72c74bdde               Mv City Cruises Erasmus
2  652955663aa8cbf72c74c92a             Benfleet Motor Yacht Club
3  652955663aa8cbf72c74cf37                       Gourmet Kitchen
4  652955663aa8cbf72c74d727  Coombs Catering t/a The Lock and Key
5  652955663aa8cbf72c74d729              Tilbury Seafarers Centre
6  652955663aa8cbf72c74de33                            Mv Valulla
7  652955673aa8cbf72c74ff3f                         Tereza Joanne
8  652955673aa8cbf72c74ff62                             Froottree
9  652955673aa8cbf72c750308                      Brick Lane Brews

### ANSWER : Establishments in London that have a RatingValue greater than or equal to 4 are listed below

In [12]:
result_df['BusinessName']

0                                Charlie's
1                  Mv City Cruises Erasmus
2                Benfleet Motor Yacht Club
3                          Gourmet Kitchen
4     Coombs Catering t/a The Lock and Key
5                 Tilbury Seafarers Centre
6                               Mv Valulla
7                            Tereza Joanne
8                                Froottree
9                         Brick Lane Brews
10                           Pret A Manger
11           The Nuance Group (UK) Limited
12                                WH Smith
13                               Cabin Bar
14                        City Bar & Grill
15                              Jet Centre
16                              Caffè Nero
17                  Mv Sunborn Yacht Hotel
18                       Good Hotel London
19                           La Nonna lina
20               Wake Up Docklands Limited
21                        MV Venus Clipper
22                      MV Typhoon clipper
23                         MV Moon clipper
24                      MV Monsoon clipper
25                      MV Jupiter clipper
26                       MV Meteor clipper
27                      MV Mercury clipper
28                      MV Tornado clipper
29                      MV Cyclone clipper
30                       MV Galaxy clipper
31                    MV Hurricane clipper
32                      MV Neptune clipper
33                          MV Sun clipper
34                        Mv Storm Clipper
35                       MV Aurora clipper
36                         Canary Wharf 1V
Name: BusinessName, dtype: object

### 3. What are the top 5 establishments with a `RatingValue` rating value of 5, sorted by lowest hygiene score, nearest to the new restaurant added, "Penang Flavours"?

In [13]:
query = {"BusinessName":"Penang Flavours"}
results = establishments.find(query)
for result in results:
    pprint(result)

{'AddressLine1': 'Penang Flavours',
 'AddressLine2': '146A Plumstead Rd',
 'AddressLine3': 'London',
 'AddressLine4': '',
 'BusinessName': 'Penang Flavours',
 'BusinessType': 'Restaurant/Cafe/Canteen',
 'BusinessTypeID': 1,
 'Distance': 4623.972328074718,
 'LocalAuthorityCode': '511',
 'LocalAuthorityEmailAddress': 'health@royalgreenwich.gov.uk',
 'LocalAuthorityName': 'Greenwich',
 'LocalAuthorityWebSite': 'http://www.royalgreenwich.gov.uk',
 'NewRatingPending': True,
 'Phone': '',
 'PostCode': 'SE18 7DY',
 'RatingValue': None,
 'RightToReply': '',
 'SchemeType': 'FHRS',
 '_id': ObjectId('652955bda434777a6ab21065'),
 'geocode': {'latitude': 51.490142, 'longitude': 0.08384},
 'scores': {'ConfidenceInManagement': '', 'Hygiene': '', 'Structural': ''}}

In [24]:
# Search within 0.01 degree on either side of the latitude and longitude.
# Rating value must equal 5
# Sort by hygiene score

degree_search = 0.01
latitudeUpper = 51.490142 + 0.01
latitudeLower = 51.490142 - 0.01
longitudeUpper = 0.08384 + 0.01
longitudeLower = 0.08384 - 0.01

query = {'RatingValue': {'$eq': 5},
            'geocode.latitude': {'$gte': latitudeLower, '$lt': latitudeUpper},
            'geocode.longitude': {'$gte': longitudeLower, '$lt': longitudeUpper}
         }
fields = {'BusinessName': 1, "scores.Hygiene": 1, 'RatingValue': 1}
sort =  [("scores.Hygiene", 1)]
limit = 5

results = list(establishments.find(query, fields).sort(sort).limit(limit))

# Print the results
pprint(results)
#print("Number of rows in result: ", len(results))

[{'BusinessName': 'Volunteer',
  'RatingValue': 5,
  '_id': ObjectId('652955673aa8cbf72c74f901'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Plumstead Manor Nursery',
  'RatingValue': 5,
  '_id': ObjectId('652955673aa8cbf72c74f911'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Atlantic Fish Bar',
  'RatingValue': 5,
  '_id': ObjectId('652955673aa8cbf72c74f913'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Iceland',
  'RatingValue': 5,
  '_id': ObjectId('652955673aa8cbf72c74f8cf'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Howe and Co Fish and Chips - Van 17',
  'RatingValue': 5,
  '_id': ObjectId('652955673aa8cbf72c74f8de'),
  'scores': {'Hygiene': 0}}]

In [25]:
# Convert result to Pandas DataFrame
result_df = pd.DataFrame(results)
result_df

,_id,BusinessName,RatingValue,scores
0,652955673aa8cbf72c74f901,Volunteer,5,{'Hygiene': 0}
1,652955673aa8cbf72c74f911,Plumstead Manor Nursery,5,{'Hygiene': 0}
2,652955673aa8cbf72c74f913,Atlantic Fish Bar,5,{'Hygiene': 0}
3,652955673aa8cbf72c74f8cf,Iceland,5,{'Hygiene': 0}
4,652955673aa8cbf72c74f8de,Howe and Co Fish and Chips - Van 17,5,{'Hygiene': 0}

### 4. How many establishments in each Local Authority area have a hygiene score of 0?

In [28]:
# Create a pipeline that: 
# 1. Matches establishments with a hygiene score of 0
match_query = {'$match': {"scores.Hygiene": {'$eq': 0}}}

# 2. Groups the matches by Local Authority
group_query = {'$group': {'_id': "$LocalAuthorityName", 
                          'count': { '$sum': 1 }}}

# 3. Sorts the matches from highest to lowest
sort_values = {'$sort': { 'count': 1 }}

pipeline = [match_query, group_query, sort_values]
results = list(establishments.aggregate(pipeline))

# Print the number of documents in the result
print("Number of documents found: ", len(results))

# Print the first 10 results
pprint(results[0:10])

Number of documents found:  55
[{'_id': 'North Norfolk', 'count': 1},
 {'_id': 'Broxbourne', 'count': 1},
 {'_id': 'Dorset', 'count': 1},
 {'_id': 'Sunderland', 'count': 1},
 {'_id': 'Reading', 'count': 1},
 {'_id': 'Kensington and Chelsea', 'count': 1},
 {'_id': 'Mid Sussex', 'count': 5},
 {'_id': 'North Hertfordshire', 'count': 6},
 {'_id': 'Tower Hamlets', 'count': 9},
 {'_id': 'Ipswich', 'count': 21}]

In [29]:
# Convert the result to a Pandas DataFrame
results_df = pd.DataFrame(results)

# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(results_df))

# Display the first 10 rows of the DataFrame
results_df.head(10)

Rows in DataFrame:  55

                      _id  count
0           North Norfolk      1
1              Broxbourne      1
2                  Dorset      1
3              Sunderland      1
4                 Reading      1
5  Kensington and Chelsea      1
6              Mid Sussex      5
7     North Hertfordshire      6
8           Tower Hamlets      9
9                 Ipswich     21